export const universities = [
  { id: 0, name: "دانشجو نیستم", availablity: true },
  { id: 1, name: "دانشگاه تهران", availablity: false },
  { id: 2, name: "دانشگاه شهید بهشتی", availablity: false },
  { id: 3, name: "دانشگاه فردوسی مشهد", availablity: false },
  { id: 4, name: "دانشگاه حکیم سبزواری", availablity: true },
  { id: 5, name: "دانشگاه آزاد واحد قزوین", availablity: false },
];

import mosalasat from "../../public/images/subjects/mosalasat.png";
import degree2 from "../../public/images/subjects/degree2.png";
export const subjects = [
  { id: 1, name: "انتگرال", numOfEp: 15, difficulty: 3, icon: mosalasat },
  { id: 2, name: "مشتق", numOfEp: 16, difficulty: 2, icon: degree2 },
];

import { OpenBook, Pencil, RescueTube } from "./icons";
export const blogs = [
  {
    id: 1,
    title: "مقالات آموزشی",
    description: "نوشته های با هدف آگاهی بیشتر",
    icon: <OpenBook />,
  },
  {
    id: 2,
    title: "راهنمای استفاده",
    description: "آموزش استفاده از خدمات مجموعه",
    icon: <RescueTube />,
  },
  {
    id: 3,
    title: "جزوات درسی",
    description: "جمع بندیت با ما",
    icon: <Pencil />,
  },
];

import SubjectIntro1 from "../../public/images/SubjectIntro/SubjectIntro1.png";
import SubjectIntro2 from "../../public/images/SubjectIntro/SubjectIntro2.png";
import SubjectIntro3 from "../../public/images/SubjectIntro/SubjectIntro3.png";
export const SubjectIntroPics = [
  { id: 1, src: SubjectIntro3, alt: "SubjectIntro3" },
  { id: 2, src: SubjectIntro2, alt: "SubjectIntro2" },
  { id: 3, src: SubjectIntro1, alt: "SubjectIntro1" },
];

export const TopSubjects = [
  { id: 1, name: "مشتق", icon: mosalasat },
  { id: 2, name: "انتگرال", icon: degree2 },
];

import { Layers } from "./icons";
export const Questions = [
  {
    id: 1,
    title: "سوال انتگرال مرتبه دوم",
    group: "تابع ها",
    difficulty: "سخت",
    score: 13,
    icon: <Layers />,
    latex: "g(x) = sin(x)",
  },
  {
    id: 2,
    title: "سوال انتگرال مرتبه دوم",
    group: "تابع ها",
    difficulty: "سخت",
    score: 13,
    icon: <Layers />,
    latex: "g(x) = sin(x)",
  },
  {
    id: 3,
    title: "سوال انتگرال مرتبه دوم",
    group: "تابع ها",
    difficulty: "سخت",
    score: 13,
    icon: <Layers />,
    latex: "g(x) = sin(x)",
  },
  {
    id: 4,
    title: "سوال انتگرال مرتبه دوم",
    group: "تابع ها",
    difficulty: "سخت",
    score: 13,
    icon: <Layers />,
    latex: "g(x) = sin(x)",
  },
  {
    id: 5,
    title: "سوال انتگرال مرتبه دوم",
    group: "تابع ها",
    difficulty: "سخت",
    score: 13,
    icon: <Layers />,
    latex: "g(x) = sin(x)",
  },
  {
    id: 6,
    title: "سوال انتگرال مرتبه دوم",
    group: "تابع ها",
    difficulty: "سخت",
    score: 13,
    icon: <Layers />,
    latex: "g(x) = sin(x)",
  },
  {
    id: 7,
    title: "سوال انتگرال مرتبه دوم",
    group: "تابع ها",
    difficulty: "سخت",
    score: 13,
    icon: <Layers />,
    latex: "g(x) = sin(x)",
  },
  {
    id: 8,
    title: "سوال انتگرال مرتبه دوم",
    group: "تابع ها",
    difficulty: "سخت",
    score: 13,
    icon: <Layers />,
    latex: "g(x) = sin(x)",
  },
];

export const descriptions = {
  مثلثات:
    "مثلثات یکی از مهم‌ترین مباحث ریاضی است که کاربرد گسترده‌ای در رشته‌های مهندسی، فیزیک، نجوم و حتی کامپیوتر دارد. این موضوع شامل کار با زوایا، نسبت‌های مثلثاتی و فرمول‌های خاص است که در مسائل پیشرفته‌تری مثل آنالیز سیگنال و طراحی سیستم‌های الکترونیکی استفاده می‌شود. یادگیری این مبحث پایه‌ای از طریق اپلیکیشن سیگما به شما کمک می‌کند تا در امتحانات دانشگاهی و کاربردهای عملی موفق باشید.",
  "معادلات درجه دو":
    "معادلات درجه دو یکی از مفاهیم اساسی در ریاضیات است که در اکثر رشته‌های دانشگاهی از جمله مهندسی، علوم پایه و اقتصاد مورد استفاده قرار می‌گیرد. این معادلات به حل مسائل مربوط به مسیر پرتابه‌ها، بهینه‌سازی و حتی تحلیل نمودارهای مالی کمک می‌کنند. در اپلیکیشن سیگما، شما می‌توانید به راحتی روش‌های حل معادلات درجه دو مانند تجزیه، فرمول کلی و تکمیل مربع را یاد بگیرید.",
  لگاریتم:
    "لگاریتم یکی از موضوعات مهم و پرکاربرد در ریاضیات پیشرفته است که در زمینه‌های گسترده‌ای از جمله علوم کامپیوتر، مهندسی، زیست‌شناسی و تحلیل داده‌ها به کار می‌رود. این مبحث درک مفاهیم رشد نمایی و کاهش، مقیاس‌بندی داده‌ها و معادلات پیچیده را آسان می‌کند. با استفاده از اپلیکیشن سیگما، یادگیری لگاریتم ساده‌تر از همیشه خواهد بود و شما را برای کاربردهای آکادمیک و عملی آماده می‌کند.",
  هندسه:
    "هندسه دانش مطالعه اشکال، زوایا و خواص فضایی آن‌ها است که نقش کلیدی در معماری، طراحی، نقشه‌کشی و حتی گرافیک کامپیوتری دارد. این مبحث علاوه بر تقویت مهارت‌های فضایی، به درک بهتر مفاهیم ریاضیات و حل مسائل عملی کمک می‌کند. با اپلیکیشن سیگما، می‌توانید اصول پایه هندسه و مفاهیم پیشرفته‌تر مانند قضیه‌های مثلثاتی و تحلیل فضایی را به آسانی بیاموزید.",
  بردارها:
    "بردارها یکی از ابزارهای اساسی در ریاضیات و فیزیک هستند که برای تحلیل حرکات، نیروها و جهت‌ها به کار می‌روند. از رشته‌های مهندسی تا شیمی کوانتومی، بردارها به عنوان زبان ریاضیات مدرن اهمیت ویژه‌ای دارند. با یادگیری این مبحث در اپلیکیشن سیگما، شما می‌توانید اصول پایه‌ای و کاربردهای پیشرفته بردارها را درک کرده و برای دانشگاه و پروژه‌های عملی آماده شوید.",
  "تئوری اعداد":
    "تئوری اعداد یکی از شاخه‌های زیبا و بنیادین ریاضیات است که به بررسی اعداد صحیح و خواص آن‌ها می‌پردازد. این مبحث نقش مهمی در رمزنگاری، امنیت داده‌ها، الگوریتم‌ها و حتی نجوم ایفا می‌کند. با یادگیری تئوری اعداد در اپلیکیشن سیگما، می‌توانید مهارت‌های خود را در زمینه‌های تحقیقاتی و کاربردهای روزمره تقویت کنید.",
  "حد و پیوستگی":
    "حد و پیوستگی، پایه‌ای‌ترین مفاهیم در حسابان هستند که برای درک تغییرات و تحلیل رفتار توابع به کار می‌روند. این مبحث در رشته‌های مهندسی، فیزیک، اقتصاد و حتی علوم کامپیوتر نقش کلیدی دارد. یادگیری حد و پیوستگی از طریق اپلیکیشن سیگما، به شما در فهم مفاهیمی مانند مشتق و انتگرال کمک می‌کند و موفقیت شما را در دانشگاه تضمین می‌کند.",
  "آمار و احتمال":
    "آمار و احتمال از موضوعات حیاتی در علوم داده، تحلیل بازار، هوش مصنوعی و بسیاری از رشته‌های مهندسی هستند. این مبحث ابزارهایی برای تحلیل داده‌ها و پیش‌بینی رویدادها فراهم می‌کند که در تصمیم‌گیری‌های روزمره و حرفه‌ای ضروری هستند. با استفاده از اپلیکیشن سیگما، شما می‌توانید اصول آمار و احتمال را به روشی ساده و کاربردی بیاموزید.",
  تابع‌ها:
    "تابع‌ها یکی از اصلی‌ترین موضوعات ریاضی هستند که پایه‌ای برای حسابان، جبر و بسیاری از علوم دیگر محسوب می‌شوند. این مبحث به بررسی ارتباط بین متغیرها می‌پردازد و درک آن برای تحلیل مسائل پیچیده‌تر ضروری است. در اپلیکیشن سیگما، شما می‌توانید مفهوم تابع‌ها را از پایه تا پیشرفته به بهترین شکل یاد بگیرید و از کاربردهای آن در دانشگاه و زندگی روزمره بهره ببرید.",
};

export const records = [
  {
    subject: "مباحث تاریخ (سخت)",
    correct: 24,
    incorrect: 6,
    score: 145,
    date: "1402/04/06",
    time: "21:23",
  },
  {
    subject: "مباحث حد و پیوستگی (متوسط)",
    correct: 16,
    incorrect: 14,
    score: 78,
    date: "1402/04/06",
    time: "21:23",
  },
  {
    subject: "مباحث ماتریکس (سخت)",
    correct: 18,
    incorrect: 12,
    score: 114,
    date: "1402/04/11",
    time: "13:12",
  },
  {
    subject: "مباحث بردار ها (آسان)",
    correct: 25,
    incorrect: 5,
    score: 146,
    date: "1402/04/20",
    time: "21:23",
  },
];

import { HeroCompetition, HeroManWithCalc, HeroScore } from "@/utils/icons";

export const IntroMenuDatas = [
  {
    title: (
      <>
        با بازی <span style={{ color: "var(--secActiveBG)" }}>ریاضی</span> یاد
        بگیرید
      </>
    ),
    desc: "با سیگما ریاضی رو بصورت چالش وار و الگوریتمی وار یاد بگیر و اموزش ببین در هر زمانی و در هرکجایی که هستی",
    picture: <HeroManWithCalc />,
  },
  {
    title: (
      <>
        <span style={{ color: "var(--thirdActiveBG)" }}>رقابت</span> با بقیه
        دانشجو ها
      </>
    ),
    desc: "با حل سوالات بیشتر با دیگر دانشجو ها در دانشگاه و کل کشور رقابت کن، تو در چه سطحی قرار میگیری؟؟.",
    picture: <HeroCompetition />,
  },
  {
    title: (
      <>
        دریافت <span style={{ color: "var(--activeBG)" }}>امتیاز</span> با حل
        سوالات
      </>
    ),
    desc: "با حل کردن هر سوال امتیاز خود را افزایش بده و تحلیل کن کجا امتیاز کمتری داری کجا نقطه ضعفته ؟",
    picture: <HeroScore />,
  },
];

import step1 from "../../public/images/temp/Rectangle 26.png";
import step2 from "../../public/images/temp/Rectangle 27.png";
import step3 from "../../public/images/temp/Rectangle 28.png";
import step4 from "../../public/images/temp/Rectangle 32.png";
import step5 from "../../public/images/temp/Rectangle 34.png";
import step6 from "../../public/images/temp/Rectangle 33.png";

export const howToSteps = [
  {
    title: <>ورود به سامانه:</>,
    desc: "ابتدا وارد سامانه شوید و با انتخاب بخش مربوط به مبحث مورد نظر (مثلاً مشتق)، وارد فضای آموزشی شوید.",
    picture: step1,
  },
  {
    title: <>شروع چالش:</>,
    desc: "در هر چالش، یک صورت‌مسئله نمایش داده می‌شود. این صورت‌مسئله به‌گونه‌ای طراحی شده که کاربر را وارد یک زنجیره استدلالی کند.",
    picture: step2,
  },
  {
    title: <>انتخاب گزینه:</>,
    desc: "برای هر مرحله، چهار گزینه نمایش داده می‌شود. شما باید با توجه به درک خود از مسئله، گزینه‌ای را که منجر به ادامه مسیر صحیح است، انتخاب کنید.",
    picture: step3,
  },
  {
    title: <>پیشروی مرحله‌ای: </>,
    desc: "با انتخاب گزینه درست، وارد گام بعدی می‌شوید. اگر گزینه اشتباه را انتخاب کنید، توضیحاتی جهت راهنمایی و اصلاح درک ارائه می‌شود تا کاربر بتواند با مرور مجدد، مسیر درست را پیدا کند.",
    picture: step4,
  },
  {
    title: <>پایان چالش:</>,
    desc: "پس از طی چندین مرحله و انتخاب‌های صحیح، به پایان چالش خواهید رسید. در انتها، یک جمع‌بندی از مفاهیم آموزش‌داده‌شده نمایش داده می‌شود.",
    picture: step5,
  },
  {
    title: <>دسترسی به منابع:</>,
    desc: "در صورت نیاز به توضیح بیشتر یا مرور مفاهیم، می‌توانید از قسمت ویدئوهای آموزشی و جزوات استفاده کنید (در حال تکمیل و به‌روزرسانی).",
    picture: step6,
  },
];

import privacy1 from "../../public/images/temp/Rectangle 15.png";
import privacy2 from "../../public/images/temp/Rectangle 16.png";

export const privacy = [
  {
    title: <>قوانین و مقررات عمومی </>,
    desc: `کلیه فعالیت‌های برای سایت سیگما میباشد و بر اساس قوانین و مقررات و نظامات جمهوری اسلامی ایران (قانون تجارت الکترونیک و قانون حمایت از حقوق مصرف کننده) و منطبق بر موازین شرعی است. ورود شما به وب‌سایت www.sigma.ir با حساب کاربری شخصی و ثبت نام، به منزله آگاهی از قوانین و مقررات و پذیرفتن کامل آن میباشد و جهل به آن غیر مسموع است.
هرکاربر متعهد میگردد اطلاعاتی را که برای تکمیل کردن فرآیند ثبت نام در سایت سیگما  انجام می‌دهد، دقیق و صحیح و متعلق به شخص باشد و مسئولیت ثبت اطلاعات غیر واقعی و جعلی ، عواقب آن به عهده کاربر خواهد بود.
هویت شخصی کاربران  محرمانه بوده و اطلاعات شخصی کاربران به هیچ شخص یا سازمان دیگری منتقل نمیگردد و کلیه اطلاعات خریداران در این سایت و اطلاعات خرید آنان محفوظ خواهد ماند  مگر با حکم مقام محترم قضایی یا اداری صالح بر طبق قوانین و مقررات در اختیار مراجع ذی‌صلاح قرار دهد. و همچنین قابلیت فروش یا ارائه به شخص ثالث مگر با حکم قضایی نخواهد داشت.
 ساعت پاسخگویی 11 تا 21 میباشد.
محصولات و خدمات ارائه شده در وب سایت سیگما  جهت  یادگیری بهتر ریاضی شما میباشد. خرید دوره ها از این وبسایت به همانند  تدریس خصوصی حضوری در خانه میباشد از  مطابق تمامی قوانین و محدودیت های    است.`,
    picture: privacy1,
  },
  {
    title: <>حریم خصوصی</>,
    desc: `کلیه فعالیت‌های برای سایت سیگما میباشد و بر اساس قوانین و مقررات و نظامات جمهوری اسلامی ایران (قانون تجارت الکترونیک و قانون حمایت از حقوق مصرف کننده) و منطبق بر موازین شرعی است. ورود شما به وب‌سایت www.sigma.ir با حساب کاربری شخصی و ثبت نام، به منزله آگاهی از قوانین و مقررات و پذیرفتن کامل آن میباشد و جهل به آن غیر مسموع است.
هرکاربر متعهد میگردد اطلاعاتی را که برای تکمیل کردن فرآیند ثبت نام در سایت سیگما  انجام می‌دهد، دقیق و صحیح و متعلق به شخص باشد و مسئولیت ثبت اطلاعات غیر واقعی و جعلی ، عواقب آن به عهده کاربر خواهد بود.
هویت شخصی کاربران  محرمانه بوده و اطلاعات شخصی کاربران به هیچ شخص یا سازمان دیگری منتقل نمیگردد و کلیه اطلاعات خریداران در این سایت و اطلاعات خرید آنان محفوظ خواهد ماند  مگر با حکم مقام محترم قضایی یا اداری صالح بر طبق قوانین و مقررات در اختیار مراجع ذی‌صلاح قرار دهد. و همچنین قابلیت فروش یا ارائه به شخص ثالث مگر با حکم قضایی نخواهد داشت. 
محصولات و خدمات ارائه شده در وب سایت سیگما  جهت  یادگیری بهتر ریاضی شما میباشد. خرید دوره ها از این وبسایت به همانند  تدریس خصوصی حضوری در خانه میباشد از  مطابق تمامی قوانین و محدودیت های    است.`,
    picture: privacy2,
  },
];

export const staffData = {
  devs: [
    {
      id: "front",
      name: "مهدی عباسی",
      avatar: "./images/staff/front.jpg",
      role: "فرانت‌اند",
      education: "ارشد نظریه سیستم",
      framework: "Next.js",
      github: "https://github.com/TheOnlyDuke",
      email: "DukeMahdinal@gmail.com",
    },
    {
      id: "back",
      name: "محمد مهدی جهانتیغی",
      avatar: "./images/staff/back.jpg",
      role: "بک‌اند",
      education: "ارشد علوم و تصمیم دانش",
      framework: "Django",
      github: "https://github.com/mohammad2831",
      email: "mhmd.2831.mahdi@gmail.com",
    },
    /*
    {
      id: "android",
      name: "یاسین قابوسی",
      avatar: "./images/staff/android.jpg",
      role: "اپلیکیشن اندروید",
      education: "کارشناسی علوم کامپیوتر",
      framework: "Flutter",
      github: "",
      email: "",
    },
    {
      id: "design",
      name: "ایلیا بازیار",
      avatar: "./images/staff/design.jpg",
      role: "UI و UX",
      education: "کارشناسی علوم کامپیوتر",
      framework: "Figma Designer",
      github: "https://github.com/iliaprm",
      telegram: "@Iliya_prm",
      email: "iliabaziyar006@gmail.com",
    },
    */
  ],
  question: [
    {
      id: "q1",
      name: "حسن ذکرآبادی",
      avatar: "./images/staff/q1.jpg",
      role: "تمامی بخش‌ها",
      education: "کارشناسی ریاضیات و کاربردها",
      email: "hassan.zekrabad@gmail.com",
    },
    {
      id: "q2",
      name: "صادق ملایجردی",
      avatar: "./images/staff/q2.jpg",
      role: "مشتق مراتب بالاتر و انتگرال‌های مثلثاتی",
      education: "کارشناسی ریاضیات و کاربردها",
      email: "ss.malaijerdy@gmail.com",
    },
    {
      id: "q3",
      name: "بهاره محمدیان",
      avatar: "./images/staff/q3.jpg",
      role: "مشتق زنجیره‌ای و انتگرال تغییر مثلثاتی",
      education: "کارشناسی علوم کامپیوتر",
      email: "bahare.mooh@gmail.com",
    },
  ],
};
